{
  "recipes": [
    {
      "title": "Oil & Vinegar Dressing",
      "category": "Dressings and Sauces",
      "description": "The Easiest Way to Make Your Salad Awesome. This take on a classic oil and vinegar dressing switches a few ingredients to up the awesome factor.",
      "picture": "ovd.png",
      "argID": "arg001",
      "ingredients": ["1 tablespoon Pumpkin Seed Oil", "2 tablespoons Apple Cider Vinegar", "1 dash/pinch of Milled Flax Seeds"],
      "instructions": "Combine all ingredients in...pretty much anything. Shake. Serve."
    },
    {
      "title": "Avocado Salad Dressing",
      "category": "Dressings and Sauces",
      "description": "This dressing is creamy as opposed to liquid-y, so it’s a nice change of pace in terms of both taste and mouth feel.",
      "picture": "asd.png",
      "argID": "arg002",
      "ingredients": [
        "2 ripe avocados",
        "juice of 1.5 limes",
        "1/8 cup balsamic vinegar",
        "1/8-1/4 cup water",
        "About 4 sprigs of cilantro",
        "1-2 tsp sea salt",
        "2 cloves fresh garlic",
        "pepper to taste"],
      "instructions": "Combine all ingredients in a food processor, and blend until smooth. Add water, just a tsp at a time, to get consistency right.  Add salt, garlic, etc to taste. Place in an airtight jar and refrigerate for up to 10 days."
    },
    {
      "title": "Nut Butter Veggie Dip",
      "category": "Dressings and Sauces",
      "description": "This recipe isn’t just good for you—it’s perfect to bring to parties or football games so people don’t have to eat garbage. Whenever you have guests over your place, make this and serve with veggies. Smile as they anoint you King.",
      "picture": "nbvd.png",
      "argID": "arg003",
      "ingredients": [
        "1/2 cup full fat organic coconut milk from the can (check the label to make sure there's no added junk!)",
        "1/2 cup raw almond butter (the ingredients should just say 'almonds')",
        "3-5 sprigs fresh cilantro",
        "juice of 1 lime",
        "tsp garlic powder",
        "about a tsp fresh ginger, grated",
        "salt and pepper to taste",
        "crushed red pepper flakes (optional)"
      ],
      "instructions": "Throw the cilantro into a food processor first to get it chopped up. Add the rest of the ingredients and pulse until smooth. Transfer to a dish and scrape the sides of your food processor with a rubber spatula. Maybe even lick said spatula. Taste, and add spices (salt, pepper, red pepper etc) as necessary. Serve with chopped fresh veggies."
    },
    {
      "title": "Best Tomato Sauce EVER",
      "category": "Dressings and Sauces",
      "description": "",
      "picture": "btse.png",
      "argID": "arg004",
      "ingredients": [
        ".5-1 cup organic tomato sauce (The best choice is Pomi, which comes in a carton, not a can.)",
        "10 or so sprigs of cilantro",
        "1 jalapeno pepper, top removed and seeded if you want a less spicy sauce.",
        "4 cloves garlic",
        "2 tbsp coconut oil, melted",
        "pinch of sea salt"
      ],
      "instructions": "Pulse cilantro, jalapeno and garlic in a food processor until finely minced. Heat tomato sauce on medium-high heat, mixing in the cilantro mixture and coconut oil. Once sauce comes to a light boil, reduce heat to low and let simmer until slightly thickened. Add salt to taste."
    },
    {
      "title": "Dirty Guacamole",
      "category": "Dressings and Sauces",
      "description": "Oh, HELL YES. Is there anything better than guacamole? Don’t bother thinking about the question, because the answer is no, there is not. As far as dips go, guac is the bees knees: it’s delish, full of healthy fat, and looks awesome in a stone bowl.",
      "picture": "dg.png",
      "argID": "arg005",
      "ingredients": [
        "Two avocados",
        "1/2 cup Fresh packed store bought salsa (just tomatoes, onions, herbs and sometimes jalapenos)",
        "Juice of 1 small lime",
        "Chopped cilantro",
        "Sea salt to taste"
      ],
      "instructions": "Mix and eat. Seriously. Make sure you put the pit in the bowl if you don't intend to eat it right away."
    },
    {
      "title": "Turkey Meatballs",
      "category": "Main Dishes",
      "description": "These meatballs are made of turkey, but you could also use lamb or pork, depending on which animals you like to eat.",
      "picture": "tk.png",
      "argID": "arg006",
      "ingredients": [
        "1 lb. extra lean ground turkey",
        "1/4 cup chopped cilantro",
        "1/4 cup chopped onion",
        "1 egg",
        "big pinch each of sea salt, cumin, pepper",
        "coconut flour (optional)"
      ],
      "instructions": "Combine everything but the coconut flour in a medium bowl. Don't be a wuss, just do it with your hands. Roll the meat into medium-large sized balls, coat lightly with coconut flour if desired. Line a 9x13 dish with aluminum foil; place meatballs in the dish. Bake at 400 degrees for about 25 min or until cooked through. Serve with Best Tomato Sauce Ever."
    }
  ]
}
